Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D27CLD2G.svd
            <register>
               <name>INTDIS</name>
               <description>Interrupt Disable Register</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>VD</name>
                     <description>Vertical Synchronization Detection Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HD</name>
                     <description>Horizontal Synchronization Detection Interrupt Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset Completed Interrupt Disable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIS</name>
                     <description>Disable Completed Interrupt Disable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DDONE</name>
                     <description>DMA Done Interrupt Disable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LDONE</name>
                     <description>DMA List Done Interrupt Disable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HISDONE</name>
                     <description>Histogram Completed Interrupt Disable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HISCLR</name>
                     <description>Histogram Clear Interrupt Disable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WERR</name>
                     <description>Write Channel Error Interrupt Disable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RERR</name>
                     <description>Read Channel Error Interrupt Disable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VFPOV</name>
                     <description>Vertical Front Porch Overflow Interrupt Disable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DAOV</name>
                     <description>Data Overflow Interrupt Disable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDTO</name>
                     <description>Vertical Synchronization Timeout Interrupt Disable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HDTO</name>
                     <description>Horizontal Synchronization Timeout Interrupt Disable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCIRERR</name>
                     <description>CCIR Decoder Error Interrupt Disable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTMASK</name>
               <description>Interrupt Mask Register</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>VD</name>
                     <description>Vertical Synchronization Detection Interrupt Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HD</name>
                     <description>Horizontal Synchronization Detection Interrupt Mask</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset Completed Interrupt Mask</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIS</name>
                     <description>Disable Completed Interrupt Mask</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DDONE</name>
                     <description>DMA Done Interrupt Mask</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LDONE</name>
                     <description>DMA List Done Interrupt Mask</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HISDONE</name>
                     <description>Histogram Completed Interrupt Mask</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HISCLR</name>
                     <description>Histogram Clear Interrupt Mask</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WERR</name>
                     <description>Write Channel Error Interrupt Mask</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RERR</name>
                     <description>Read Channel Error Interrupt Mask</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VFPOV</name>
                     <description>Vertical Front Porch Overflow Interrupt Mask</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DAOV</name>
                     <description>Data Overflow Interrupt Mask</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDTO</name>
                     <description>Vertical Synchronization Timeout Interrupt Mask</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HDTO</name>
                     <description>Horizontal Synchronization Timeout Interrupt Mask</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCIRERR</name>
                     <description>CCIR Decoder Error Interrupt Mask</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTSR</name>
               <description>Interrupt Status Register</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>VD</name>
                     <description>Vertical Synchronization Detected Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HD</name>
                     <description>Horizontal Synchronization Detected Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset Completed Interrupt</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIS</name>
                     <description>Disable Completed Interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DDONE</name>
                     <description>DMA Done Interrupt</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LDONE</name>
                     <description>DMA List Done Interrupt</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HISDONE</name>
                     <description>Histogram Completed Interrupt</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HISCLR</name>
                     <description>Histogram Clear Interrupt</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WERR</name>
                     <description>Write Channel Error Interrupt</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WERRID</name>
                     <description>Write Channel Error Identifier</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>WERRIDSelect</name>
                        <enumeratedValue>
                           <name>CH0</name>
                           <description>An error occurred for Channel 0 (RAW/RGB/Y)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CH1</name>
                           <description>An error occurred for Channel 1 (CbCr/Cb)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CH2</name>
                           <description>An error occurred for Channel 2 (Cr)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WB</name>
                           <description>Write back channel error</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RERR</name>
                     <description>Read Channel Error Interrupt</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VFPOV</name>
                     <description>Vertical Front Porch Overflow Interrupt</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DAOV</name>
                     <description>Data Overflow Interrupt</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDTO</name>
                     <description>Vertical Synchronization Timeout Interrupt</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HDTO</name>
                     <description>Horizontal Synchronization Timeout Interrupt</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCIRERR</name>
                     <description>CCIR Decoder Error Interrupt</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WB_CTRL</name>
               <description>White Balance Control Register</description>
               <addressOffset>0x58</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>White Balance Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WB_CFG</name>
               <description>White Balance Configuration Register</description>
               <addressOffset>0x5C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>BAYCFG</name>
                     <description>White Balance Bayer Configuration (Pixel Color Pattern)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>BAYCFGSelect</name>
                        <enumeratedValue>
                           <name>GRGR</name>
                           <description>Starting Row configuration is G R G R (Red Row)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RGRG</name>
                           <description>Starting Row configuration is R G R G (Red Row)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GBGB</name>
                           <description>Starting Row configuration is G B G B (Blue Row)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BGBG</name>
                           <description>Starting Row configuration is B G B G (Blue Row)</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WB_O_RGR</name>
               <description>White Balance Offset for R, GR Register</description>
               <addressOffset>0x60</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ROFST</name>
                     <description>Offset Red Component (signed 13 bits 1:12:0)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
                  <field>
                     <name>GROFST</name>
                     <description>Offset Green Component for Red Row (signed 13 bits 1:12:0)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WB_O_BGB</name>
               <description>White Balance Offset for B, GB Register</description>
               <addressOffset>0x64</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>BOFST</name>
                     <description>Offset Blue Component (signed 13 bits, 1:12:0)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
                  <field>
                     <name>GBOFST</name>
                     <description>Offset Green Component for Blue Row (signed 13 bits, 1:12:0)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WB_G_RGR</name>
               <description>White Balance Gain for R, GR Register</description>
               <addressOffset>0x68</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RGAIN</name>
                     <description>Red Component Gain (unsigned 13 bits, 0:4:9)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
                  <field>
                     <name>GRGAIN</name>
                     <description>Green Component (Red row) Gain (unsigned 13 bits, 0:4:9)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WB_G_BGB</name>
               <description>White Balance Gain for B, GB Register</description>
               <addressOffset>0x6C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>BGAIN</name>
                     <description>Blue Component Gain (unsigned 13 bits, 0:4:9)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
                  <field>
                     <name>GBGAIN</name>
                     <description>Green Component (Blue row) Gain (unsigned 13 bits, 0:4:9)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFA_CTRL</name>
               <description>Color Filter Array Control Register</description>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Color Filter Array Interpolation Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFA_CFG</name>
               <description>Color Filter Array Configuration Register</description>
               <addressOffset>0x74</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>BAYCFG</name>
                     <description>Color Filter Array Pattern</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>BAYCFGSelect</name>
                        <enumeratedValue>
                           <name>GRGR</name>
                           <description>Starting row configuration is G R G R (red row)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RGRG</name>
                           <description>Starting row configuration is R G R G (red row</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GBGB</name>
                           <description>Starting row configuration is G B G B (blue row)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BGBG</name>
                           <description>Starting row configuration is B G B G (blue row)</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EITPOL</name>
                     <description>Edge Interpolation</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CC_CTRL</name>
               <description>Color Correction Control Register</description>
               <addressOffset>0x78</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Color Correction Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
