Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D27CLD2G.svd
            <register>
               <name>EVR0</name>
               <description>Event Counter 0 Value Register</description>
               <addressOffset>0x210</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Event Counter Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IMR</name>
               <description>Interrupt Mask Register</description>
               <addressOffset>0x214</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ECNTR</name>
                     <description>Event Counter 1/0 Overflow Increment</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PARRT</name>
                     <description>Parity Error on L2 Tag RAM, Read</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PARRD</name>
                     <description>Parity Error on L2 Data RAM, Read</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRWT</name>
                     <description>Error on L2 Tag RAM, Write</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRWD</name>
                     <description>Error on L2 Data RAM, Write</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRRT</name>
                     <description>Error on L2 Tag RAM, Read</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRRD</name>
                     <description>Error on L2 Data RAM, Read</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLVERR</name>
                     <description>SLVERR from L3 Memory</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DECERR</name>
                     <description>DECERR from L3 Memory</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MISR</name>
               <description>Masked Interrupt Status Register</description>
               <addressOffset>0x218</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ECNTR</name>
                     <description>Event Counter 1/0 Overflow Increment</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PARRT</name>
                     <description>Parity Error on L2 Tag RAM, Read</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PARRD</name>
                     <description>Parity Error on L2 Data RAM, Read</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRWT</name>
                     <description>Error on L2 Tag RAM, Write</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRWD</name>
                     <description>Error on L2 Data RAM, Write</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRRT</name>
                     <description>Error on L2 Tag RAM, Read</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRRD</name>
                     <description>Error on L2 Data RAM, Read</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLVERR</name>
                     <description>SLVERR from L3 memory</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DECERR</name>
                     <description>DECERR from L3 memory</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RISR</name>
               <description>Raw Interrupt Status Register</description>
               <addressOffset>0x21C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ECNTR</name>
                     <description>Event Counter 1/0 Overflow Increment</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PARRT</name>
                     <description>Parity Error on L2 Tag RAM, Read</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PARRD</name>
                     <description>Parity Error on L2 Data RAM, Read</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRWT</name>
                     <description>Error on L2 Tag RAM, Write</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRWD</name>
                     <description>Error on L2 Data RAM, Write</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRRT</name>
                     <description>Error on L2 Tag RAM, Read</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRRD</name>
                     <description>Error on L2 Data RAM, Read</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLVERR</name>
                     <description>SLVERR from L3 memory</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DECERR</name>
                     <description>DECERR from L3 memory</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICR</name>
               <description>Interrupt Clear Register</description>
               <addressOffset>0x220</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ECNTR</name>
                     <description>Event Counter 1/0 Overflow Increment</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PARRT</name>
                     <description>Parity Error on L2 Tag RAM, Read</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PARRD</name>
                     <description>Parity Error on L2 Data RAM, Read</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRWT</name>
                     <description>Error on L2 Tag RAM, Write</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRWD</name>
                     <description>Error on L2 Data RAM, Write</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRRT</name>
                     <description>Error on L2 Tag RAM, Read</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRRD</name>
                     <description>Error on L2 Data RAM, Read</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLVERR</name>
                     <description>SLVERR from L3 memory</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DECERR</name>
                     <description>DECERR from L3 memory</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR</name>
               <description>Cache Synchronization Register</description>
               <addressOffset>0x730</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>C</name>
                     <description>Cache Synchronization Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPALR</name>
               <description>Invalidate Physical Address Line Register</description>
               <addressOffset>0x770</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>C</name>
                     <description>Cache Synchronization Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDX</name>
                     <description>Index Number</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>TAG</name>
                     <description>Tag Number</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IWR</name>
               <description>Invalidate Way Register</description>
               <addressOffset>0x77C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WAY0</name>
                     <description>Invalidate Way Number 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAY1</name>
                     <description>Invalidate Way Number 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAY2</name>
                     <description>Invalidate Way Number 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAY3</name>
                     <description>Invalidate Way Number 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAY4</name>
                     <description>Invalidate Way Number 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAY5</name>
                     <description>Invalidate Way Number 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAY6</name>
                     <description>Invalidate Way Number 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAY7</name>
                     <description>Invalidate Way Number 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPALR</name>
               <description>Clean Physical Address Line Register</description>
               <addressOffset>0x7B0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>C</name>
                     <description>Cache Synchronization Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDX</name>
                     <description>Index number</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>TAG</name>
                     <description>Tag number</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CIR</name>
               <description>Clean Index Register</description>
               <addressOffset>0x7B8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>C</name>
                     <description>Cache Synchronization Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDX</name>
                     <description>Index number</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>WAY</name>
                     <description>Way number</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CWR</name>
               <description>Clean Way Register</description>
               <addressOffset>0x7BC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WAY0</name>
                     <description>Clean Way Number 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAY1</name>
                     <description>Clean Way Number 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAY2</name>
                     <description>Clean Way Number 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAY3</name>
                     <description>Clean Way Number 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAY4</name>
                     <description>Clean Way Number 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAY5</name>
                     <description>Clean Way Number 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAY6</name>
                     <description>Clean Way Number 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAY7</name>
                     <description>Clean Way Number 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CIPALR</name>
               <description>Clean Invalidate Physical Address Line Register</description>
               <addressOffset>0x7F0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>C</name>
                     <description>Cache Synchronization Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDX</name>
                     <description>Index Number</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>TAG</name>
                     <description>Tag Number</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CIIR</name>
               <description>Clean Invalidate Index Register</description>
               <addressOffset>0x7F8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>C</name>
                     <description>Cache Synchronization Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDX</name>
                     <description>Index Number</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>WAY</name>
                     <description>Way Number</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CIWR</name>
               <description>Clean Invalidate Way Register</description>
               <addressOffset>0x7FC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WAY0</name>
                     <description>Clean Invalidate Way Number 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAY1</name>
                     <description>Clean Invalidate Way Number 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAY2</name>
                     <description>Clean Invalidate Way Number 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAY3</name>
                     <description>Clean Invalidate Way Number 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAY4</name>
                     <description>Clean Invalidate Way Number 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAY5</name>
                     <description>Clean Invalidate Way Number 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAY6</name>
                     <description>Clean Invalidate Way Number 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAY7</name>
                     <description>Clean Invalidate Way Number 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
