Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D27CLD2G.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>SHDWC</name>
         <version>6122S</version>
         <description>Shutdown Controller</description>
         <groupName>SHDWC</groupName>
         <prependToName>SHDWC_</prependToName>
         <baseAddress>0xF8048010</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SHDW_CR</name>
               <description>Shutdown Control Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>SHDW</name>
                     <description>Shutdown Command</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KEY</name>
                     <description>Password</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>KEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation.</description>
                           <value>0xA5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHDW_MR</name>
               <description>Shutdown Mode Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RTCWKEN</name>
                     <description>Real-time Clock Wake-up Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACCWKEN</name>
                     <description>Analog Comparator Controller Wake-up Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXLPWKEN</name>
                     <description>Debug Unit Wake-up Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WKUPDBC</name>
                     <description>Wake-up Inputs Debouncer Period</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>WKUPDBCSelect</name>
                        <enumeratedValue>
                           <name>IMMEDIATE</name>
                           <description>Immediate, no debouncing, detected active at least on one Slow Clock edge</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3_SLCK</name>
                           <description>PIOBUx shall be in its active state for at least 3 SLCK periods</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32_SLCK</name>
                           <description>PIOBUx shall be in its active state for at least 32 SLCK periods</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_512_SLCK</name>
                           <description>PIOBUx shall be in its active state for at least 512 SLCK periods</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_4096_SLCK</name>
                           <description>PIOBUx shall be in its active state for at least 4,096 SLCK periods</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32768_SLCK</name>
                           <description>PIOBUx shall be in its active state for at least 32,768 SLCK periods</description>
                           <value>0x5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHDW_SR</name>
               <description>Shutdown Status Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WKUPS</name>
                     <description>PIOBU, WKUP Wake-up Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>WKUPSSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No wake-up due to the assertion of the PIOBU, WKUP pins has occurred since the last read of SHDW_SR.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PRESENT</name>
                           <description>At least one wake-up due to the assertion of the PIOBU, WKUP pins has occurred since the last read of SHDW_SR.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RTCWK</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACCWK</name>
                     <description>Analog Comparator Controller Wake-up</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXLPWK</name>
                     <description>Debug Unit Wake-up</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WKUPIS0</name>
                     <description>Wake-up 0 Input Status</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>WKUPIS0Select</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WKUPIS1</name>
                     <description>Wake-up 1 Input Status</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>WKUPIS1Select</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WKUPIS2</name>
                     <description>Wake-up 2 Input Status</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>WKUPIS2Select</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WKUPIS3</name>
                     <description>Wake-up 3 Input Status</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>WKUPIS3Select</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WKUPIS4</name>
                     <description>Wake-up 4 Input Status</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>WKUPIS4Select</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WKUPIS5</name>
                     <description>Wake-up 5 Input Status</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>WKUPIS5Select</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WKUPIS6</name>
                     <description>Wake-up 6 Input Status</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>WKUPIS6Select</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WKUPIS7</name>
                     <description>Wake-up 7 Input Status</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>WKUPIS7Select</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WKUPIS8</name>
                     <description>Wake-up 8 Input Status</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>WKUPIS8Select</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WKUPIS9</name>
                     <description>Wake-up 9 Input Status</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>WKUPIS9Select</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
