Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D27CLD2G.svd
            <register>
               <name>TCMR</name>
               <description>Transmit Clock Mode Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CKS</name>
                     <description>Transmit Clock Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CKSSelect</name>
                        <enumeratedValue>
                           <name>MCK</name>
                           <description>Divided Clock</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RK</name>
                           <description>RK Clock signal</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TK</name>
                           <description>TK pin</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CKO</name>
                     <description>Transmit Clock Output Mode Selection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>CKOSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>None, TK pin is an input</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CONTINUOUS</name>
                           <description>Continuous Transmit Clock, TK pin is an output</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRANSFER</name>
                           <description>Transmit Clock only during data transfers, TK pin is an output</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CKI</name>
                     <description>Transmit Clock Inversion</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKG</name>
                     <description>Transmit Clock Gating Selection</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CKGSelect</name>
                        <enumeratedValue>
                           <name>CONTINUOUS</name>
                           <description>None</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN_TF_LOW</name>
                           <description>Transmit Clock enabled only if TF Low</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN_TF_HIGH</name>
                           <description>Transmit Clock enabled only if TF High</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>START</name>
                     <description>Transmit Start Selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>STARTSelect</name>
                        <enumeratedValue>
                           <name>CONTINUOUS</name>
                           <description>Continuous, as soon as a word is written in the SSC_THR (if Transmit is enabled), and immediately after the end of transfer of the previous data</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RECEIVE</name>
                           <description>Receive start</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TF_LOW</name>
                           <description>Detection of a low level on TF signal</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TF_HIGH</name>
                           <description>Detection of a high level on TF signal</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TF_FALLING</name>
                           <description>Detection of a falling edge on TF signal</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TF_RISING</name>
                           <description>Detection of a rising edge on TF signal</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TF_LEVEL</name>
                           <description>Detection of any level change on TF signal</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TF_EDGE</name>
                           <description>Detection of any edge on TF signal</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>STTDLY</name>
                     <description>Transmit Start Delay</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PERIOD</name>
                     <description>Transmit Period Divider Selection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TFMR</name>
               <description>Transmit Frame Mode Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DATLEN</name>
                     <description>Data Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DATDEF</name>
                     <description>Data Default Value</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSBF</name>
                     <description>Most Significant Bit First</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATNB</name>
                     <description>Data Number per Frame</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FSLEN</name>
                     <description>Transmit Frame Sync Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FSOS</name>
                     <description>Transmit Frame Sync Output Selection</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>FSOSSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>None, TF pin is an input</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NEGATIVE</name>
                           <description>Negative Pulse, TF pin is an output</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>POSITIVE</name>
                           <description>Positive Pulse, TF pin is an output</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Driven Low during data transfer</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>Driven High during data transfer</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TOGGLING</name>
                           <description>Toggling at each start of data transfer</description>
                           <value>0x5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FSDEN</name>
                     <description>Frame Sync Data Enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSEDGE</name>
                     <description>Frame Sync Edge Detection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FSEDGESelect</name>
                        <enumeratedValue>
                           <name>POSITIVE</name>
                           <description>Positive Edge Detection</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NEGATIVE</name>
                           <description>Negative Edge Detection</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FSLEN_EXT</name>
                     <description>FSLEN Field Extension</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RHR</name>
               <description>Receive Holding Register</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RDAT</name>
                     <description>Receive Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>THR</name>
               <description>Transmit Holding Register</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>TDAT</name>
                     <description>Transmit Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RSHR</name>
               <description>Receive Sync. Holding Register</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RSDAT</name>
                     <description>Receive Synchronization Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TSHR</name>
               <description>Transmit Sync. Holding Register</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TSDAT</name>
                     <description>Transmit Synchronization Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RC0R</name>
               <description>Receive Compare 0 Register</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CP0</name>
                     <description>Receive Compare Data 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RC1R</name>
               <description>Receive Compare 1 Register</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CP1</name>
                     <description>Receive Compare Data 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <description>Status Register</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXRDY</name>
                     <description>Transmit Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEMPTY</name>
                     <description>Transmit Empty</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXRDY</name>
                     <description>Receive Ready</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRUN</name>
                     <description>Receive Overrun</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CP0</name>
                     <description>Compare 0</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CP1</name>
                     <description>Compare 1</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXSYN</name>
                     <description>Transmit Sync</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXSYN</name>
                     <description>Receive Sync</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEN</name>
                     <description>Transmit Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXEN</name>
                     <description>Receive Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IER</name>
               <description>Interrupt Enable Register</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>TXRDY</name>
                     <description>Transmit Ready Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEMPTY</name>
                     <description>Transmit Empty Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXRDY</name>
                     <description>Receive Ready Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRUN</name>
                     <description>Receive Overrun Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CP0</name>
                     <description>Compare 0 Interrupt Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CP1</name>
                     <description>Compare 1 Interrupt Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXSYN</name>
                     <description>Tx Sync Interrupt Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXSYN</name>
                     <description>Rx Sync Interrupt Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IDR</name>
               <description>Interrupt Disable Register</description>
               <addressOffset>0x48</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>TXRDY</name>
                     <description>Transmit Ready Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEMPTY</name>
                     <description>Transmit Empty Interrupt Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXRDY</name>
                     <description>Receive Ready Interrupt Disable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRUN</name>
                     <description>Receive Overrun Interrupt Disable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CP0</name>
                     <description>Compare 0 Interrupt Disable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CP1</name>
                     <description>Compare 1 Interrupt Disable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXSYN</name>
                     <description>Tx Sync Interrupt Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXSYN</name>
                     <description>Rx Sync Interrupt Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
